In [1]:
import pandas as pd

In [9]:
df=pd.read_csv(r"vgsales.csv")
#We ccan add a new column to our dataset as shown for the first 3 values of our data

In [10]:
df.head(3)

,Rank,Name,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,2006.0,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,1985.0,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,2008.0,15.85,12.88,3.79,3.31,35.82

In [22]:
df ['Total'] = df['NA_Sales'] + df['EU_Sales'] + df['JP_Sales'] + df['Other_Sales'] + df['Global_Sales']

In [27]:
df.head(3)
#Thres a new column with totals added

,Rank,Name,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,Total
0,1,Wii Sports,2006.0,41.49,29.02,3.77,8.46,82.74,165.48
1,2,Super Mario Bros.,1985.0,29.08,3.58,6.81,0.77,40.24,80.48
2,3,Mario Kart Wii,2008.0,15.85,12.88,3.79,3.31,35.82,71.65

In [37]:

#We can drop the above 'totals' column  as shown below

In [35]:
df= df.drop(columns=['Total'])

In [36]:
df.head(3)

,Rank,Name,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,2006.0,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,1985.0,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,2008.0,15.85,12.88,3.79,3.31,35.82